<?php
// PHPの研修カリキュラム2-15
?>
<?php
/*
PHPの
研修
カリキュラム
2-15
*/
?>
<html>
    <p>I say that <?php echo "Hello World!!"; ?></p>
</html>

<?php
echo "1.ログ(意味、確認の仕方)"."<br>";
echo "※起こった出来事についての情報などを一定の形式で時系列に記録・蓄積したデータのこと。船の航海記録（日誌）が原義。
確認の仕方：コマンドプロンプト"."<br>";

echo "2.クラウドサーバー、レンタルサーバー、VPSの違い"."<br>";
echo "※クラウドサーバー：文字通りクラウド環境に作られたサーバーのことです。 インターネットのネットワークでの利用を前提とした、クラウドコンピューティングのこと ※レンタルサーバー：サーバーを貸し出すサービスのことです。つまり、ホームページ公開の際などに必要なサーバーの中で、サーバー構築のためのコンピュータや設置場所の確保、常時起動しての管理を、業者側が行ってくれるものを指します。※VPS：仮想サーバを提供する「仮想専用サーバサービス」です。契約者ごとに物理的なサーバが1台ずつ用意される「専用サーバ」と異なり、1台の物理サーバ上に契約者ごとの仮想サーバを構築します。VPSの契約者は、サーバを物理的には専有しませんが、root権限（管理者権限）が付与されます。"."<br>";

echo "3.PHPのFWの種類と特徴"."<br>";
echo "※種類：CakePHP・Zend Framework・Symfony・Code Igniter・Fuel PHP・Ethna・Laravel
※特徴：フレームワーク全体のコードも少なく、他のフレームワークと比べても全体的にすっきりとしたフレームワークなので、
どこにどのような処理を組み込んでいるかも管理しやすいです。
また、コーディング規約も緩く、使い易いので、学習コストも低く、導入しやすいフレームワークと言えます。"."<br>";

?><img class="alignnone size-full wp-image-371" src="http://54.238.147.46/wp-content/uploads/2020/04/update_task_status.png" alt="" width="716" height="180" data-pagespeed-url-hash="608921261" onload="pagespeed.CriticalImages.checkImageForCriticality(this);">