<?php
// PHPの研修カリキュラム2-1
?>
<?php
/*
PHPの
研修
カリキュラム
2-1
*/
?>
<html>
    <p>I say that <?php echo "Hello World!!"; ?></p>
</html>

<?php
echo "1.開発環境・検証環境・本番環境"."<br>";
echo "※開発環境：機器やソフトウェア、システムを開発するために必要な機材やソフトウェアなどの組み合わせ。また、それらを組み合わせて構成された、開発者の作業環境。※検証環境：装置やソフトウェア、システムの開発において、正しく動作するか検証する試験（テスト）のために用意された機材やソフトウェアなどの動作環境。※本番環境：情報システムやソフトウェアの開発で、できあがった製品を実際に稼働させて利用に供するための施設や機材、ソフトウェアなどを組み合わせた運用環境のこと。"."<br>";

echo "2.基本設計書・詳細設計書"."<br>";
echo "※基本設計書：製品の基本的な設計。また、製品開発において基本的な設計を策定する工程。構成や仕様、機能などの概要をまとめたものを意味する場合と、中枢や基盤の設計を意味する場合がある。※詳細設計書：ソフトウェアや情報システムの開発工程の一つで、前工程で定義された要素の仕様や動作の詳細を定義する工程。全体の工程の分割の仕方により具体的な作業内容が異なる。"."<br>";

echo "3.Ajax"."<br>";
echo "※あるWebページを表示した状態のまま、別のページや再読込などを伴わずにWebサーバ側と通信を行い、動的に表示内容を変更する手法。ページ上でプログラムを実行できるプログラミング言語JavaScriptの拡張機能を用いること。"."<br>";
?><img class="alignnone size-full wp-image-371" src="http://54.238.147.46/wp-content/uploads/2020/04/update_task_status.png" alt="" width="716" height="180" data-pagespeed-url-hash="608921261" onload="pagespeed.CriticalImages.checkImageForCriticality(this);">